workspace/InformationRegisters/АукИтогиЗавершенияЭтапов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИтогиЗавершенияЭтапов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРезультатаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаСтавки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукИтогиЗавершенияЭтапов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт	
	сткРез = АукОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "АукИтогиЗавершенияЭтапов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат АукОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "АукИтогиЗавершенияЭтапов");
	
КонецФункции	

Функция ИтоговоеЗначениеЛидирующейСтавки(пСткОтбор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукИтогиЗавершенияЭтапов.ПредставлениеРезультатаРасчета КАК ПредставлениеРезультатаРасчета
	|ИЗ
	|	РегистрСведений.АукИтогиЗавершенияЭтапов КАК АукИтогиЗавершенияЭтапов
	|ГДЕ
	|	АукИтогиЗавершенияЭтапов.Аукцион = &Аукцион
	|	И АукИтогиЗавершенияЭтапов.НомерЭтапа = &НомерЭтапа";
	
	Запрос.УстановитьПараметр("Аукцион",	пСткОтбор.Аукцион);
	Запрос.УстановитьПараметр("НомерЭтапа", пСткОтбор.НомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.ПредставлениеРезультатаРасчета;	
	КонецЕсли;	
КонецФункции

#КонецОбласти
